import React from "react";
import { useNavigate } from "react-router-dom";

function Agreement(props) {
  const { title } = props;
  document.title = title;
  const navigate = useNavigate();

  const goBack = () => navigate(-1);

  return (
    <>
      <div className="agreement-content">
        <button onClick={goBack} className="go-back">← Повернутися назад</button>
        <p>ГРОМАДСЬКА ОРГАНІЗАЦІЯ «РЕНЮВЛ» (ГО «РЕНЮВЛ») є неприбутковою громадською організацією та фінансується з різних джерел. Відповідно до Статуту, Організація може отримувати допомогу у вигляді коштів або майна, що надходять безоплатно у вигляді членських внесків, безповоротної фінансової допомоги, пожертв, грантів для реалізації статутних цілей Організації.</p>
        <p>Здійснити благодійну пожертву можна таким чином:</p>
        <ol>
            <li>На гривневий рахунок: UA053052990000026001040712532, Код ЄДРПОУ 44364357, призначення платежу: Безповоротна фінансова допомога.</li>
            <li>Через платіжну систему LIQPAY</li>
        </ol>
        <p><strong>ПУБЛІЧНИЙ ДОГОВІР ПРО НАДАННЯ НЕЦІЛЬОВОЇ БЕЗПОВОРОТНОЇ ДОБРОВІЛЬНОЇ ДОПОМОГИ</strong></p>
        <p>ГО «РЕНЮВЛ» , яка діє на підставі Статуту (далі – ГО), з одного боку, пропонує необмеженому колу осіб (далі – «Благодійник»), з іншого боку, далі за текстом кожен окремо – «Сторона» а спільно – «Сторони», укласти цей Договір про таке:</p>
        <p><strong>Стаття 1. Предмет договору</strong></p>
        <p>1.1. Сторони погоджуються з тим, що ГО може отримувати допомогу у вигляді коштів або майна, що надходить безоплатно у вигляді членських внесків, безповоротної фінансової допомоги, пожертв, грантів, та буде спрямовувати її на реалізацію статутних цілей ГО.</p>
        <p>1.2. Публічним збором добровільних пожертв визнається добровільний збір коштів серед невизначеного кола осіб, зокрема з використанням засобів електронного зв’язку.</p>
        <p>1.3. Добровільні пожертви спрямовуються на реалізацію статутних цілей ГО.</p>
        <p>1.4. Предметом цього Договором не є пряме чи опосередковане отримання прибутку жодною із Сторін.</p>
        <p><strong>Стаття 2. Зобов’язання ГО</strong></p>
        <p>2.1. ГО зобов’язується:</p>
        <p>- використати зібрані кошти відповідно до статутних цілей ГО;</p>
        <p>- надати звіт Благодійнику (за вимогою) про спрямування ГО коштів, одержаних за цим договором;</p>
        <p>- за попередньою згодою Благодійника, публікувати інформацію про здійснену ним пожертву на сторінці ГО в мережі Інтернет.</p>
        <p><strong>Стаття 3. Зобов’язання Благодійника</strong></p>
        <p>3.1. Благодійник зобов’язується здійснювати:</p>
        <p>- добровільне пожертвування у формі безготівкового перерахування коштів на поточний рахунок ГО через платіжну систему LiqPay, бажано – із призначенням платежу: «Безповоротна фінансова допомога».</p>
        <p><strong>Стаття 4. Гарантії</strong></p>
        <p>4.1. ГО має виключне право на користування грошовими коштами, отриманими за цим Договором. ГО несе відповідальність за те, що треті особи не мають претензій, що можуть обмежити користування грошовими коштами, якщо такі претензії не викликані діями ГО або одержувачів благодійної допомоги та нецільової благодійної допомоги.</p>
        <p>4.2. Благодійник дає згоду на те, що пожертва не підлягає поверненню.</p>
        <p>4.3. Укладаючи цей Договір, Благодійник підтверджує, що він не має претензій щодо можливих напрямків використання ГО переданих Благодійником коштів або майна, в тому числі на адміністративні витрати в рамках чинного законодавства України.</p>
        <p>4.4. Згідно з чинним законодавством України, в разі припинення діяльності організації, кошти та майно організації буде передано державі або іншим неприбутковим організаціям.</p>
        <p><strong>Стаття 5. Приймання майна</strong></p>
        <p>5.1. ГО зобов’язується не допускати використання коштів, наданих Благодійниками, з іншою метою, крім статутних цілей ГО та забезпечення адміністративних витрат ГО.</p>
        <p>5.2. Грошові кошти вважаються переданими Благодійником з моменту зарахування їх на розрахунковий рахунок ГО, через платіжну систему LiqPay або PayPal.</p>
        <p><strong>Стаття 6. Контроль</strong></p>
        <p>6.1. ГО надає Благодійнику звіти про використання зібраних грошових коштів, за його вимогою, відповідно п. 2.1. цього Договору.</p>
        <p>6.2. Управлінський і бухгалтерський облік, а також статистичну звітність щодо надання та використання благодійних пожертв для цілей, визначених договором, веде ГО.</p>
        <p><strong>Стаття 7. Укладення договору</strong></p>
        <p>7.1. Цей Договір вважається укладеним з моменту перерахування Благодійником коштів.</p>
        <p>7.2. Цей договір діє до виконання сторонами взятих на себе за цим Договором зобов’язань.</p>
        <p><strong>Стаття 8. Форс-мажор</strong></p>
        <p>8.1. Сторони не відповідають за повне або часткове невиконання Договору, спричинене дією (подією) непереборної сили (форс-мажору), якщо повідомляють про неї іншу Сторону протягом десяти днів з письмовим підтвердженням Торговельної палати України або іншого компетентного.</p>
        <p>8.2. До форс-мажору належать: військові дії, мобілізація, страйки, карантини, пожежі, вибухи, дорожньо-транспортні пригоди і стихійні катастрофи, а також акти органів державної влади і місцевого самоврядування, та інші події, згідно із чинним законодавством України.</p>
        <p><strong>Стаття 9. Припинення договору</strong></p>
        <p>9.1. Договір припиняється внаслідок повного виконання зобов’язань Сторонами один перед одним.</p>
        <p><strong>Стаття 10. Відмова від подальшої участі в Договорі</strong></p>
        <p>10.1. Письмова заява будь-якої Сторони про відмову від участі у Договорі має бути зроблена не пізніше, ніж за десять днів до дати припинення участі у Договорі.</p>
        <p><strong>Стаття 11. Відповідальність Сторін</strong></p>
        <p>11.1. За невиконання або неналежне виконання зобов’язань за даною угодою, ГО та Благодійник несуть відповідальність відповідно до чинного законодавства України і цього договору (Цивільний кодекс України, Закон України «Про громадські об’єднання» та інші НПА).</p>
        <p><strong>Стаття 12. Місцезнаходження та реквізити ГО</strong></p>
        <p>НАЙМЕНУВАННЯ ОРГАНІЗАЦІЇ: ГРОМАДСЬКА ОРГАНІЗАЦІЯ «РЕНЮВЛ»</p>
        <p>КОД ЄДРПОУ: 44364357</p>
        <p>НАЗВА БАНКУ: АТ КБ «ПРИВАТБАНК»</p>
        <p>ГРИВНЕВИЙ РАХУНОК ОТРИМУВАЧА У ФОРМАТІ IBAN: UA053052990000026001040712532</p>
        <p>___</p>
        <p style={{marginBottom: '50px'}}>e-mail: <a href="mailto:renewal.ngo@gmail.com">renewal.ngo@gmail.com</a></p>
        <button onClick={goBack} className="go-back">← Повернутися назад</button>
      </div>
    </>
  );
}

export default Agreement;
